ezois_ka/oooezoiskaobmen/src/Documents/ПриказОПрекращенииБронирования/ПриказОПрекращенииБронирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОПрекращенииБронирования</name>
  <registerRecords>InformationRegister.БронированиеСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПрекращенияБронирования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйПоБронированию</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственногоПоБронированию</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнениеКонтролирует</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьКонтролирующего</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументСерия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтраховойНомерПФР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Военкомат</name>
      <type>
        <types>CatalogRef.Военкоматы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВУС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Catalogs/РегистрацииВНалоговомОргане/РегистрацииВНалоговомОргане.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегистрацииВНалоговомОргане</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Доверенность</name>
    <comment>Доверенность налогоплательщика на представителя</comment>
    <type>
      <types>CatalogRef.ДоверенностиНалогоплательщика</types>
      <types>CatalogRef.МашиночитаемыеДоверенностиФНС</types>
      <types>CatalogRef.МашиночитаемыеДоверенностиРаспределенныйРеестр</types>
      <types>CatalogRef.МашиночитаемыеДоверенности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПредставителя</name>
    <comment>Название документа, подтверждающего полномочия представителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>Код причины постановки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИФНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОбособленногоПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представитель</name>
    <comment>Представитель в территориальном органе ФНС</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УполномоченноеЛицоПредставителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРегиона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановкиНаУчет</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСнятияСУчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <comment>Филиал / ГО</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КрупнейшийНалогоплательщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подписанты</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <comment>Доверенность налогоплательщика на представителя</comment>
      <type>
        <types>CatalogRef.ДоверенностиНалогоплательщика</types>
        <types>CatalogRef.МашиночитаемыеДоверенностиФНС</types>
        <types>CatalogRef.МашиночитаемыеДоверенностиРаспределенныйРеестр</types>
        <types>CatalogRef.МашиночитаемыеДоверенности</types>
      </type>
    </attributes>
    <attributes>
      <name>Представитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УполномоченноеЛицоПредставителя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПредставителя</name>
      <comment>Название документа, подтверждающего полномочия представителя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ezois_ka/oooezoiskaobmen/src/Catalogs/Военкоматы/Военкоматы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Военкоматы</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресВнутреннееПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ezois_ka/oooezoiskaobmen/src/Documents/ПриказОПрекращенииБронирования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ВоинскийУчет.ДляОтбораПоОрганизации(Настройки);
	ВоинскийУчет.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ПриказОПрекращенииБронирования;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПриказОПрекращенииБронирования";
	КомандаПечати.Представление = НСтр("ru = 'Приказ о прекращении бронирования'");
	КомандаПечати.Порядок = 10;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "ПФ_MXL_СписокРаботниковБронированиеКоторыхПрекращено";
	КомандаПечати.Представление = НСтр("ru = 'Список работников'");
	КомандаПечати.Порядок = 20;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "ПФ_MXL_ВыпискаИзПриказаОПрекращенииБронирования";
	КомандаПечати.Представление = НСтр("ru = 'Выписка из приказа о прекращении бронирования'");
	КомандаПечати.Порядок = 30;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СписокРаботниковБронированиеКоторыхПрекращено") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ПФ_MXL_СписокРаботниковБронированиеКоторыхПрекращено", 
			НСтр("ru = 'Список работников'"), 
			ПечатнаяФормаСписокРаботниковБронированиеКоторыхПрекращено(МассивОбъектов, ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ВыпискаИзПриказаОПрекращенииБронирования") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ПФ_MXL_ВыпискаИзПриказаОПрекращенииБронирования", 
			НСтр("ru = 'Выписка из приказа о прекращении бронирования'"), 
			ПечатнаяФормаВыпискаИзПриказаОПрекращенииБронирования(МассивОбъектов, ОбъектыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПриказОПрекращенииБронирования") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ПФ_MXL_ПриказОПрекращенииБронирования", 
			НСтр("ru = 'Приказ о прекращении бронирования'"), 
			ПечатнаяФормаПриказОПрекращенииБронирования(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатнаяФормаСписокРаботниковБронированиеКоторыхПрекращено(МассивОбъектов, ОбъектыПечати)
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЕФС_1";
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ВыборкаПоШапкеДокумента = ЗапросПоШапкеДляПечати(МассивОбъектов).Выбрать();
	ВыборкаПоРаботникам = ЗапросПоСотрудникамДляПечати(МассивОбъектов).Выбрать();
	
	Пока ВыборкаПоШапкеДокумента.СледующийПоЗначениюПоля("Ссылка") Цикл 
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриказОПрекращенииБронирования.ПФ_MXL_СписокРаботниковБронированиеКоторыхПрекращено");
		
		НачалоФормы = ДокументРезультат.ВысотаТаблицы + 1;
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьСубъектРФ = Макет.ПолучитьОбласть("СубъектРФ");
		ОбластьВоенкомат = Макет.ПолучитьОбласть("Военкомат");
		
		ОбластьЗаголовок.Параметры.ДатаПриказа = Формат(ВыборкаПоШапкеДокумента.Дата, "ДЛФ=Д");
		ОбластьЗаголовок.Параметры.НомерПриказа = ЗарплатаКадрыОтчеты.НомерНаПечать(ВыборкаПоШапкеДокумента.Номер, ВыборкаПоШапкеДокумента.НомерПриказа);
		ОбластьЗаголовок.Параметры.НаименованиеОрганизации = ВыборкаПоШапкеДокумента.НаименованиеОрганизации;
		
		ДокументРезультат.Вывести(ОбластьЗаголовок);
		ДокументРезультат.Вывести(ОбластьШапка);
		
		ВыборкаПоРаботникам.Сбросить();
		
		Если ВыборкаПоРаботникам.НайтиСледующий(Новый Структура("Ссылка", ВыборкаПоШапкеДокумента.Ссылка)) Тогда
			
			НомерСтроки = 1;
			ВыборкаПоРаботникам.СледующийПоЗначениюПоля("Ссылка");
			
			Пока ВыборкаПоРаботникам.СледующийПоЗначениюПоля("СубъектРФ") Цикл
				
				ОбластьСубъектРФ.Параметры.НаименованиеСубъектаРФ = ВыборкаПоРаботникам.СубъектРФ;
				
				ВыводимыеОбласти = Новый Массив;
				ВыводимыеОбласти.Добавить(ОбластьСубъектРФ);
				
				Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				ДокументРезультат.Вывести(ОбластьСубъектРФ);
				
				Пока ВыборкаПоРаботникам.СледующийПоЗначениюПоля("Военкомат") Цикл 
					
					ОбластьВоенкомат.Параметры.НаименованиеВоенкомата = Строка(ВыборкаПоРаботникам.Военкомат); 
					ОбластьВоенкомат.Параметры.АдресВоенкомата = ВыборкаПоРаботникам.АдресВоенкомата; 
					
					ВыводимыеОбласти = Новый Массив;
					ВыводимыеОбласти.Добавить(ОбластьВоенкомат);
					
					Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					ДокументРезультат.Вывести(ОбластьВоенкомат);
					
					Пока ВыборкаПоРаботникам.Следующий() Цикл
						
						ПаспортныеДанные = "";
						Если ЗначениеЗаполнено(ВыборкаПоРаботникам.ДокументСерия) Тогда 
							ПаспортныеДанные = ВыборкаПоРаботникам.ДокументСерия;
						КонецЕсли;
						Если ЗначениеЗаполнено(ВыборкаПоРаботникам.ДокументНомер) Тогда 
							ПаспортныеДанные = ПаспортныеДанные + ?(ЗначениеЗаполнено(ПаспортныеДанные), " ", "") + ВыборкаПоРаботникам.ДокументНомер;
						КонецЕсли;
						Если ЗначениеЗаполнено(ВыборкаПоРаботникам.ДокументДатаВыдачи) Тогда 
							ПаспортныеДанные = ПаспортныеДанные + ?(ЗначениеЗаполнено(ПаспортныеДанные), ", ", "") + Формат(ВыборкаПоРаботникам.ДокументДатаВыдачи, "ДЛФ=Д");
						КонецЕсли;
						
			    		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры, ВыборкаПоРаботникам);
						ОбластьСтрокаТаблицы.Параметры.НомерСтроки = НомерСтроки;
						ОбластьСтрокаТаблицы.Параметры.ПаспортныеДанные = ПаспортныеДанные;
						
						ВыводимыеОбласти = Новый Массив;
						ВыводимыеОбласти.Добавить(ОбластьСтрокаТаблицы);
						
						Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						КонецЕсли;
						
						ДокументРезультат.Вывести(ОбластьСтрокаТаблицы);
						НомерСтроки = НомерСтроки + 1;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	    ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НачалоФормы, ОбъектыПечати, ВыборкаПоШапкеДокумента.Ссылка);
		
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции

Функция ПечатнаяФормаВыпискаИзПриказаОПрекращенииБронирования(МассивОбъектов, ОбъектыПечати)
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЕФС_1";
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ВыборкаПоШапкеДокумента = ЗапросПоШапкеДляПечати(МассивОбъектов).Выбрать();
	ВыборкаПоРаботникам = ЗапросПоСотрудникамДляПечати(МассивОбъектов).Выбрать();
	
	Пока ВыборкаПоШапкеДокумента.СледующийПоЗначениюПоля("Ссылка") Цикл 
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриказОПрекращенииБронирования.ПФ_MXL_ВыпискаИзПриказаОПрекращенииБронирования");
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ВыборкаПоРаботникам.Сбросить();
		
		Если ВыборкаПоРаботникам.НайтиСледующий(Новый Структура("Ссылка", ВыборкаПоШапкеДокумента.Ссылка)) Тогда
			
			ВыборкаПоРаботникам.СледующийПоЗначениюПоля("Ссылка");
			
			Пока ВыборкаПоРаботникам.СледующийПоЗначениюПоля("Военкомат") Цикл 
				
				ОбластьЗаголовок.Параметры.НаименованиеОрганизации = ВыборкаПоШапкеДокумента.НаименованиеОрганизации;
				Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ИНН) Тогда 
					ОбластьЗаголовок.Параметры.НаименованиеОрганизации = ВыборкаПоШапкеДокумента.НаименованиеОрганизации + НСтр("ru = ' ИНН '") + ВыборкаПоШапкеДокумента.ИНН;
				КонецЕсли;
				ОбластьЗаголовок.Параметры.НаименованиеВоенкомата = Строка(ВыборкаПоРаботникам.Военкомат);
				
				ДокументРезультат.Вывести(ОбластьЗаголовок);
				ДокументРезультат.Вывести(ОбластьШапка);
				
				НачалоФормы = ДокументРезультат.ВысотаТаблицы + 1;
				НомерСтроки = 1;
				
				Пока ВыборкаПоРаботникам.Следующий() Цикл
					
					ПаспортныеДанные = "";
					Если ЗначениеЗаполнено(ВыборкаПоРаботникам.ДокументСерия) Тогда 
						ПаспортныеДанные = ВыборкаПоРаботникам.ДокументСерия;
					КонецЕсли;
					Если ЗначениеЗаполнено(ВыборкаПоРаботникам.ДокументНомер) Тогда 
						ПаспортныеДанные = ПаспортныеДанные + ?(ЗначениеЗаполнено(ПаспортныеДанные), " ", "") + ВыборкаПоРаботникам.ДокументНомер;
					КонецЕсли;
					Если ЗначениеЗаполнено(ВыборкаПоРаботникам.ДокументДатаВыдачи) Тогда 
						ПаспортныеДанные = ПаспортныеДанные + ?(ЗначениеЗаполнено(ПаспортныеДанные), ", ", "") + Формат(ВыборкаПоРаботникам.ДокументДатаВыдачи, "ДЛФ=Д");
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры, ВыборкаПоРаботникам);
					ОбластьСтрокаТаблицы.Параметры.НомерСтроки = НомерСтроки;
					ОбластьСтрокаТаблицы.Параметры.ПаспортныеДанные = ПаспортныеДанные;
					
					ВыводимыеОбласти = Новый Массив;
					ВыводимыеОбласти.Добавить(ОбластьСтрокаТаблицы);
					
					Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					ДокументРезультат.Вывести(ОбластьСтрокаТаблицы);
					НомерСтроки = НомерСтроки + 1;
					
				КонецЦикла;
				
				ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ВыборкаПоШапкеДокумента);
				ОбластьПодвал.Параметры.ДатаПриказа = Формат(ВыборкаПоШапкеДокумента.Дата, "ДЛФ=Д");
				
				ВыводимыеОбласти = Новый Массив;
				ВыводимыеОбласти.Добавить(ОбластьПодвал);
				
				Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				ДокументРезультат.Вывести(ОбластьПодвал);
				
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НачалоФормы, ОбъектыПечати, ВыборкаПоШапкеДокумента.Ссылка);
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции

Функция ПечатнаяФормаПриказОПрекращенииБронирования(МассивОбъектов, ОбъектыПечати)
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриказОПрекращенииБронирования";
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ВыборкаПоШапкеДокумента = ЗапросПоШапкеДляПечати(МассивОбъектов).Выбрать();
	
	Пока ВыборкаПоШапкеДокумента.СледующийПоЗначениюПоля("Ссылка") Цикл 
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриказОПрекращенииБронирования.ПФ_MXL_ПриказОПрекращенииБронирования");
		
		НачалоФормы = ДокументРезультат.ВысотаТаблицы + 1;
		
		ОбластьПриказ = Макет.ПолучитьОбласть("Приказ");
		
		ОбластьПриказ.Параметры.ДатаПриказа = Формат(ВыборкаПоШапкеДокумента.Дата, "ДЛФ=ДД");
		ОбластьПриказ.Параметры.НомерПриказа = ЗарплатаКадрыОтчеты.НомерНаПечать(ВыборкаПоШапкеДокумента.Номер, ВыборкаПоШапкеДокумента.НомерПриказа);
		
		НаименованиеОрганизации = ВыборкаПоШапкеДокумента.НаименованиеОрганизации;
		Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.НаименованиеСокращенное)
			И СокрЛП(ВыборкаПоШапкеДокумента.НаименованиеСокращенное) <> СокрЛП(ВыборкаПоШапкеДокумента.НаименованиеОрганизации) Тогда
			НаименованиеОрганизации = НаименованиеОрганизации + Символы.ПС + ВыборкаПоШапкеДокумента.НаименованиеСокращенное;
		КонецЕсли;
		
		ОбластьПриказ.Параметры.ПолноеНаименованиеОрганизации = НаименованиеОрганизации;
		
		КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаПоШапкеДокумента.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации, ВыборкаПоШапкеДокумента.Дата, Ложь);
		Если КонтактнаяИнформация.Количество() > 0 Тогда 
			ОбластьПриказ.Параметры.АдресОрганизации = КонтактнаяИнформация[0].Представление;
		    ОбластьПриказ.Параметры.Город = РаботаСАдресами.ГородАдресаКонтактнойИнформации(КонтактнаяИнформация[0].ЗначенияПолей);
		КонецЕсли;
		
		СведенияОбОрганизации = "";
		Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ИНН) Тогда 
			СведенияОбОрганизации = СведенияОбОрганизации + ?(ЗначениеЗаполнено(СведенияОбОрганизации), ", ", "") + НСтр("ru='ИНН '") + ВыборкаПоШапкеДокумента.ИНН;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.КПП) Тогда 
			СведенияОбОрганизации = СведенияОбОрганизации + ?(ЗначениеЗаполнено(СведенияОбОрганизации), ", ", "") + НСтр("ru='КПП '") + ВыборкаПоШапкеДокумента.КПП;
			Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПериодРегистрации) Тогда
				СведенияОбОрганизации = СведенияОбОрганизации + " " + Формат(ВыборкаПоШапкеДокумента.ПериодРегистрации, "ДЛФ=Д"); 
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ОКАТО) Тогда 
			СведенияОбОрганизации = СведенияОбОрганизации + ?(ЗначениеЗаполнено(СведенияОбОрганизации), ", ", "") + НСтр("ru='ОКАТО '") + ВыборкаПоШапкеДокумента.ОКАТО;
		КонецЕсли;
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда 
			МодульГосударственнаяСлужба = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
			ОКОГУ = МодульГосударственнаяСлужба.СвойстваОрганизацииГосударственнойСлужбы(ВыборкаПоШапкеДокумента.Организация).ОКОГУ;
			Если ЗначениеЗаполнено(ОКОГУ) Тогда 
				СведенияОбОрганизации = СведенияОбОрганизации + ?(ЗначениеЗаполнено(СведенияОбОрганизации), ", ", "") + НСтр("ru='ОКОГУ '") + ОКОГУ;
			КонецЕсли;
		КонецЕсли;
		
		ОбластьПриказ.Параметры.СведенияОбОрганизации = СведенияОбОрганизации; 
		
		ОбластьПриказ.Параметры.НаименованиеОрганизации = ?(ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.НаименованиеСокращенное),
			ВыборкаПоШапкеДокумента.НаименованиеСокращенное, ВыборкаПоШапкеДокумента.НаименованиеОрганизации);
			
		ОбластьПриказ.Параметры.ОснованиеПрекращенияБронирования = ВыборкаПоШапкеДокумента.ОснованиеПрекращенияБронирования;
		
		Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ОтветственныйПоБронированию) Тогда
			ОтветственныйПоБронированию = ЗарплатаКадрыОтчеты.ПросклоненныеФИО(ВыборкаПоШапкеДокумента.ОтветственныйПоБронированию, 3, ВыборкаПоШапкеДокумента.ПолОтветственногоПоБронированию);
			Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДолжностьОтветственногоПоБронированию) Тогда 
				ОтветственныйПоБронированию = ЗарплатаКадрыОтчеты.ПросклоненноеПредставление(Строка(ВыборкаПоШапкеДокумента.ДолжностьОтветственногоПоБронированию), 3) + " " + ОтветственныйПоБронированию;
			КонецЕсли; 
			ОбластьПриказ.Параметры.ОтветственныйПоБронированию = ОтветственныйПоБронированию;
		КонецЕсли;
		
		ОбластьПриказ.Параметры.КонтрольЗаИсполнением = НСтр("ru='оставляю за собой'");
		Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ИсполнениеКонтролирует) Тогда
			ОбластьПриказ.Параметры.КонтрольЗаИсполнением = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='возложить на %1 %2'"), 
				?(ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДолжностьКонтролирующего), ЗарплатаКадрыОтчеты.ПросклоненноеПредставление(ВыборкаПоШапкеДокумента.ДолжностьКонтролирующего, 4), ""), 
				ЗарплатаКадрыОтчеты.ПросклоненныеФИО(ВыборкаПоШапкеДокумента.ИсполнениеКонтролирует, 4, ВыборкаПоШапкеДокумента.ПолКонтролирующего));
		КонецЕсли;
		
		ОбластьПриказ.Параметры.ДолжностьРуководителя = ВыборкаПоШапкеДокумента.ДолжностьРуководителя;
		ОбластьПриказ.Параметры.РуководительРасшифровкаПодписи = ВыборкаПоШапкеДокумента.РуководительРасшифровкаПодписи;
		
		ДокументРезультат.Вывести(ОбластьПриказ);
		
	    ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НачалоФормы, ОбъектыПечати, ВыборкаПоШапкеДокумента.Ссылка);
		
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции

Функция ЗапросПоШапкеДляПечати(МассивСсылок)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПриказОПрекращенииБронирования.Дата КАК Дата,
		|	ПриказОПрекращенииБронирования.Номер КАК Номер,
		|	ПриказОПрекращенииБронирования.НомерПриказа КАК НомерПриказа,
		|	ПриказОПрекращенииБронирования.Организация КАК Организация,
		|	ПриказОПрекращенииБронирования.Ссылка КАК Ссылка,
		|	ПриказОПрекращенииБронирования.Руководитель КАК Руководитель,
		|	ПриказОПрекращенииБронирования.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	ПриказОПрекращенииБронирования.ОснованиеПрекращенияБронирования КАК ОснованиеПрекращенияБронирования,
		|	ПриказОПрекращенииБронирования.ОтветственныйПоБронированию КАК ОтветственныйПоБронированию,
		|	ПриказОПрекращенииБронирования.ДолжностьОтветственногоПоБронированию КАК ДолжностьОтветственногоПоБронированию,
		|	ПриказОПрекращенииБронирования.ОтветственныйПоБронированию.Пол КАК ПолОтветственногоПоБронированию,
		|	ПриказОПрекращенииБронирования.ИсполнениеКонтролирует КАК ИсполнениеКонтролирует,
		|	ПриказОПрекращенииБронирования.ДолжностьКонтролирующего КАК ДолжностьКонтролирующего,
		|	ПриказОПрекращенииБронирования.ИсполнениеКонтролирует.Пол КАК ПолКонтролирующего
		|ПОМЕСТИТЬ ВТДанныеДокументов
		|ИЗ
		|	Документ.ПриказОПрекращенииБронирования КАК ПриказОПрекращенииБронирования
		|ГДЕ
		|	ПриказОПрекращенииБронирования.Ссылка В(&МассивСсылок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеДокументов.Организация КАК СтруктурнаяЕдиница,
		|	ДанныеДокументов.Дата КАК Период
		|ПОМЕСТИТЬ ВТОрганизацииПериоды
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов";
	
	Запрос.Выполнить();
	
	ИменаПолейОтветственныхЛиц = Новый Массив;
	ИменаПолейОтветственныхЛиц.Добавить("Руководитель");
	ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Истина, ИменаПолейОтветственныхЛиц, "ВТДанныеДокументов");
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ИсторияРегистрацийВНалоговомОргане",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТОрганизацииПериоды",
			"СтруктурнаяЕдиница"));
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокументов.Дата КАК Дата,
		|	ДанныеДокументов.Номер КАК Номер,
		|	ДанныеДокументов.НомерПриказа КАК НомерПриказа,
		|	ДанныеДокументов.Организация КАК Организация,
		|	ДанныеДокументов.Ссылка КАК Ссылка,
		|	ДанныеДокументов.Руководитель КАК Руководитель,
		|	ДанныеДокументов.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	ДанныеДокументов.ОснованиеПрекращенияБронирования КАК ОснованиеПрекращенияБронирования,
		|	ДанныеДокументов.ОтветственныйПоБронированию КАК ОтветственныйПоБронированию,
		|	ДанныеДокументов.ДолжностьОтветственногоПоБронированию КАК ДолжностьОтветственногоПоБронированию,
		|	ДанныеДокументов.ПолОтветственногоПоБронированию КАК ПолОтветственногоПоБронированию,
		|	ДанныеДокументов.ИсполнениеКонтролирует КАК ИсполнениеКонтролирует,
		|	ДанныеДокументов.ДолжностьКонтролирующего КАК ДолжностьКонтролирующего,
		|	ДанныеДокументов.ПолКонтролирующего КАК ПолКонтролирующего,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(Организации.НаименованиеПолное, 1, 10) <> """"
		|			ТОГДА Организации.НаименованиеПолное
		|		ИНАЧЕ Организации.Наименование
		|	КОНЕЦ КАК НаименованиеОрганизации,
		|	Организации.НаименованиеПолное КАК НаименованиеПолное,
		|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
		|	Организации.ИНН КАК ИНН,
		|	ИсторияРегистрацийВНалоговомОрганеСрезПоследних.ПериодЗаписи КАК ПериодРегистрации,
		|	ЕСТЬNULL(РегистрацииВНалоговомОргане.Ссылка, ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) КАК РегистрацияВНалоговомОргане,
		|	ЕСТЬNULL(РегистрацииВНалоговомОргане.КПП, """") КАК КПП,
		|	ЕСТЬNULL(РегистрацииВНалоговомОргане.НаименованиеИФНС, """") КАК НаименованиеИФНС,
		|	ЕСТЬNULL(РегистрацииВНалоговомОргане.КодПоОКАТО, """") КАК ОКАТО,
		|	ФИООтветственныхЛиц.РасшифровкаПодписи КАК РуководительРасшифровкаПодписи
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ДанныеДокументов.Организация = Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИООтветственныхЛиц
		|		ПО ДанныеДокументов.Руководитель = ФИООтветственныхЛиц.ФизическоеЛицо
		|			И ДанныеДокументов.Ссылка = ФИООтветственныхЛиц.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсторияРегистрацийВНалоговомОрганеСрезПоследних КАК ИсторияРегистрацийВНалоговомОрганеСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|			ПО ИсторияРегистрацийВНалоговомОрганеСрезПоследних.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
		|		ПО ДанныеДокументов.Организация = ИсторияРегистрацийВНалоговомОрганеСрезПоследних.СтруктурнаяЕдиница
		|			И ДанныеДокументов.Дата = ИсторияРегистрацийВНалоговомОрганеСрезПоследних.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеДокументов.Дата,
		|	Ссылка";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ЗапросПоСотрудникамДляПечати(МассивСсылок)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.НомерСтроки КАК НомерСтроки,
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.Сотрудник.Наименование КАК ФИОПолные,
		|	Сотрудники.Пол КАК Пол,
		|	Сотрудники.ДатаРождения КАК ДатаРождения,
		|	Сотрудники.ДокументСерия КАК ДокументСерия,
		|	Сотрудники.ДокументНомер КАК ДокументНомер,
		|	Сотрудники.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		|	Сотрудники.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	Сотрудники.Военкомат КАК Военкомат,
		|	Сотрудники.ВУС КАК ВУС,
		|	Сотрудники.Примечание КАК Примечание
		|ПОМЕСТИТЬ ВТДанныеДокументов
		|ИЗ
		|	Документ.ПриказОПрекращенииБронирования.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В(&МассивСсылок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеДокументов.Военкомат КАК Военкомат
		|ПОМЕСТИТЬ ВТВоенкоматыДокумента
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВоенкоматыДокумента.Военкомат КАК Военкомат,
		|	Военкоматы.АдресВнутреннееПредставление КАК Адрес
		|ИЗ
		|	ВТВоенкоматыДокумента КАК ВоенкоматыДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Военкоматы КАК Военкоматы
		|		ПО ВоенкоматыДокумента.Военкомат = Военкоматы.Ссылка";
	
	РегионыВоенкоматов = Новый ТаблицаЗначений;
	РегионыВоенкоматов.Колонки.Добавить("Военкомат", Новый ОписаниеТипов("СправочникСсылка.Военкоматы"));
	РегионыВоенкоматов.Колонки.Добавить("СубъектРФ", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВоенкомата = РегионыВоенкоматов.Добавить();
		ДанныеВоенкомата.Военкомат = Выборка.Военкомат;
		Если ЗначениеЗаполнено(Выборка.Адрес) Тогда 
			ДанныеВоенкомата.СубъектРФ = РаботаСАдресами.РегионАдресаКонтактнойИнформации(Выборка.Адрес);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("РегионыВоенкоматов", РегионыВоенкоматов);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегионыВоенкоматов.Военкомат КАК Военкомат,
		|	РегионыВоенкоматов.СубъектРФ КАК СубъектРФ
		|ПОМЕСТИТЬ ВТРегионыВоенкоматов
		|ИЗ
		|	&РегионыВоенкоматов КАК РегионыВоенкоматов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеДокументов.Ссылка КАК Ссылка,
		|	ДанныеДокументов.Сотрудник КАК Сотрудник,
		|	ДанныеДокументов.Сотрудник.Наименование КАК ФИОПолные,
		|	ДанныеДокументов.Пол КАК Пол,
		|	ДанныеДокументов.ДатаРождения КАК ДатаРождения,
		|	ДанныеДокументов.ДокументСерия КАК ДокументСерия,
		|	ДанныеДокументов.ДокументНомер КАК ДокументНомер,
		|	ДанныеДокументов.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		|	ДанныеДокументов.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ЕСТЬNULL(РегионыВоенкоматов.СубъектРФ, """") КАК СубъектРФ,
		|	ДанныеДокументов.Военкомат КАК Военкомат,
		|	Военкоматы.Адрес КАК АдресВоенкомата,
		|	ДанныеДокументов.ВУС КАК ВУС,
		|	ДанныеДокументов.Примечание КАК Примечание
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРегионыВоенкоматов КАК РегионыВоенкоматов
		|		ПО ДанныеДокументов.Военкомат = РегионыВоенкоматов.Военкомат
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Военкоматы КАК Военкоматы
		|		ПО ДанныеДокументов.Военкомат = Военкоматы.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	СубъектРФ,
		|	Военкомат,
		|	ДанныеДокументов.НомерСтроки";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
